## Plan output

```
module.app["dc-sebt-portal"].module.service["web"].data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_partition.current: Reading...
module.logging.module.s3.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].module.alb["this"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.alb["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Reading...
module.app["dc-sebt-portal"].module.database.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.database.data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.rds: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=76086537]
module.vpc.data.aws_vpc_endpoint_service.services["ec2messages"]: Read complete after 0s [id=2187510914]
module.app["dc-sebt-portal"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.database.data.aws_rds_engine_version.this: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ssm"]: Read complete after 0s [id=874300523]
module.vpc.data.aws_vpc_endpoint_service.services["ec2"]: Read complete after 0s [id=2644592029]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Reading...
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs_insights: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.vpc.data.aws_vpc_endpoint_service.services["ssm-contacts"]: Read complete after 0s [id=3701104373]
module.vpc.data.aws_vpc_endpoint_service.services["guardduty-data"]: Read complete after 0s [id=3795168285]
module.app["dc-sebt-portal"].module.database.data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.database.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Reading...
module.vpc.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.logging.data.aws_elb_service_account.current: Reading...
module.logging.data.aws_elb_service_account.current: Read complete after 0s [id=127311923021]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_vpc_endpoint_service.services["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.data.aws_vpc_endpoint_service.services["ssmmessages"]: Read complete after 0s [id=1315226949]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Reading...
module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].module.service["web"].data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_partition.current: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_partition.current: Read complete after 0s [id=aws]
module.app["dc-sebt-portal"].data.aws_cloudwatch_log_groups.ecs: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_region.current: Reading...
module.app["dc-sebt-portal"].data.aws_region.current: Reading...
module.logging.module.s3.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.module.s3.data.aws_caller_identity.current: Reading...
module.logging.data.aws_caller_identity.identity: Reading...
module.app["dc-sebt-portal"].module.database.data.aws_caller_identity.identity: Reading...
module.logging.module.s3.data.aws_caller_identity.current: Read complete after 0s [id=816069131564]
module.logging.data.aws_partition.current: Reading...
module.logging.data.aws_partition.current: Read complete after 0s [id=aws]
module.logging.data.aws_region.current: Reading...
module.logging.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.logging.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].data.aws_rds_engine_version.this: Reading...
module.app["dc-sebt-portal"].module.database.data.aws_caller_identity.identity: Read complete after 0s [id=816069131564]
module.logging.data.aws_lambda_functions.all: Reading...
module.vpc.data.aws_availability_zones.available: Reading...
module.logging.module.s3.data.aws_organizations_organization.current: Reading...
module.vpc.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Reading...
module.app["dc-sebt-portal"].module.secrets.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_region.current[0]: Reading...
module.vpc.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.vpc.module.vpc.data.aws_caller_identity.current[0]: Read complete after 0s [id=816069131564]
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Reading...
module.app["dc-sebt-portal"].module.service["web"].module.ecr["this"].data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=77330188]
module.app["dc-sebt-portal"].data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.service["web"].data.aws_ssm_parameter.version["/sebt-portal/development/web/version"]: Reading...
module.logging.data.aws_lambda_functions.all: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Reading...
module.logging.data.aws_lambda_function.datadog["this"]: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_ssm_parameter.version["/sebt-portal/development/web/version"]: Read complete after 0s [id=/sebt-portal/development/web/version]
module.app["dc-sebt-portal"].module.service["web"].data.aws_route53_zone.domain["this"]: Reading...
module.app["dc-sebt-portal"].module.service["web"].data.aws_route53_zone.domain["this"]: Read complete after 1s [id=Z0097236342AE196VY5TV]
module.logging.module.s3.data.aws_iam_policy_document.default: Reading...
module.logging.module.s3.data.aws_iam_policy_document.default: Read complete after 0s [id=3580588753]
module.logging.module.s3.data.aws_organizations_organization.current: Read complete after 1s [id=o-f5mr0gq6lc]
module.app["dc-sebt-portal"].data.aws_lambda_function.datadog["this"]: Read complete after 1s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.logging.data.aws_lambda_function.datadog["this"]: Read complete after 1s [id=DatadogIntegration-ForwarderStack-W7KLT9-Forwarder-VufEAiofNX9f]
module.app["dc-sebt-portal"].module.database.data.aws_rds_engine_version.this: Read complete after 1s [id=16.00.4185.3.v1]
module.logging.module.s3.data.aws_iam_policy_document.combined: Reading...
module.logging.module.s3.data.aws_iam_policy_document.combined: Read complete after 0s [id=199516603]
module.app["dc-sebt-portal"].data.aws_rds_engine_version.this: Read complete after 1s [id=16.00.4185.3.v1]
module.vpc.data.aws_subnets.endpoints["ec2"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Reading...
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Reading...
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Reading...
module.vpc.data.aws_subnets.endpoints["ec2"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Reading...
module.vpc.data.aws_subnets.endpoints["ecr.dkr"]: Read complete after 0s [id=us-east-1]
module.app["dc-sebt-portal"].module.service["web"].data.aws_vpc.current: Reading...
module.vpc.data.aws_subnets.endpoints["ec2messages"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-contacts"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssm-incidents"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["guardduty-data"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ecr.api"]: Read complete after 0s [id=us-east-1]
module.vpc.data.aws_subnets.endpoints["ssmmessages"]: Read complete after 0s [id=us-east-1]
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Reading...
module.vpc.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0]: Read complete after 0s [id=2856726747]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2"]: Read complete after 0s [id=2644592029]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["guardduty-data"]: Read complete after 0s [id=3795168285]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ec2messages"]: Read complete after 0s [id=2187510914]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Reading...
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm"]: Read complete after 0s [id=874300523]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["s3"]: Read complete after 0s [id=195798706]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-incidents"]: Read complete after 0s [id=3798321550]
module.app["dc-sebt-portal"].module.service["web"].data.aws_vpc.current: Read complete after 0s [id=vpc-024d66fcc4f521d0a]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssmmessages"]: Read complete after 0s [id=1315226949]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.dkr"]: Read complete after 0s [id=1314884315]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ecr.api"]: Read complete after 0s [id=1808222790]
module.vpc.module.endpoints.data.aws_vpc_endpoint_service.this["ssm-contacts"]: Read complete after 0s [id=3701104373]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

OpenTofu will perform the following actions:

  # module.app["dc-sebt-portal"].aws_kms_alias.database will be destroyed
  # (because aws_kms_alias.database is not in configuration)
  - resource "aws_kms_alias" "database" {
      - arn            = "arn:aws:kms:us-east-1:816069131564:alias/sebt-portal/development/database" -> null
      - id             = "alias/sebt-portal/development/database" -> null
      - name           = "alias/sebt-portal/development/database" -> null
      - target_key_arn = "arn:aws:kms:us-east-1:816069131564:key/685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
      - target_key_id  = "685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
    }

  # module.app["dc-sebt-portal"].aws_kms_key.database will be destroyed
  # (because aws_kms_key.database is not in configuration)
  - resource "aws_kms_key" "database" {
      - arn                                = "arn:aws:kms:us-east-1:816069131564:key/685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
      - bypass_policy_lockout_safety_check = false -> null
      - customer_master_key_spec           = "SYMMETRIC_DEFAULT" -> null
      - deletion_window_in_days            = 7 -> null
      - description                        = "Database encryption key for sebt-portal development" -> null
      - enable_key_rotation                = true -> null
      - id                                 = "685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
      - is_enabled                         = true -> null
      - key_id                             = "685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
      - key_usage                          = "ENCRYPT_DECRYPT" -> null
      - multi_region                       = false -> null
      - policy                             = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "kms:*"
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Enable IAM User Permissions"
                    },
                  - {
                      - Action    = [
                          - "kms:Encrypt",
                          - "kms:Decrypt",
                          - "kms:ReEncrypt*",
                          - "kms:GenerateDataKey*",
                          - "kms:CreateGrant",
                          - "kms:ListGrants",
                          - "kms:DescribeKey",
                        ]
                      - Condition = {
                          - "ForAnyValue:StringEquals" = {
                              - "kms:EncryptionContextKeys" = "aws:rds:db-id"
                            }
                          - StringEquals               = {
                              - "kms:CallerAccount" = "816069131564"
                              - "kms:ViaService"    = "rds.us-east-1.amazonaws.com"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "*"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow access through RDS for all principals in the account that are authorized to use RDS"
                    },
                  - {
                      - Action    = [
                          - "kms:Describe*",
                          - "kms:Get*",
                          - "kms:List*",
                          - "kms:RevokeGrant",
                        ]
                      - Effect    = "Allow"
                      - Principal = {
                          - AWS = "arn:aws:iam::816069131564:root"
                        }
                      - Resource  = "*"
                      - Sid       = "Allow direct access to key metadata to the account"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - rotation_period_in_days            = 365 -> null
      - tags                               = {
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all                           = {
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
    }

  # module.app["dc-sebt-portal"].aws_vpc_security_group_ingress_rule.database["web"] must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "database" {
      ~ arn                          = "arn:aws:ec2:us-east-1:816069131564:security-group-rule/sgr-0928ecae42f045758" -> (known after apply)
      ~ from_port                    = 1433 -> (known after apply)
      ~ id                           = "sgr-0928ecae42f045758" -> (known after apply)
      ~ security_group_id            = "sg-052c720f2d7d35631" # forces replacement -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-0928ecae42f045758" -> (known after apply)
      ~ to_port                      = 1433 -> (known after apply)
        # (3 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database.aws_kms_alias.database will be created
  + resource "aws_kms_alias" "database" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/sebt-portal/development/database"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.database.aws_kms_key.database will be created
  + resource "aws_kms_key" "database" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 7
      + description                        = "Database encryption key for sebt-portal development"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "kms:*"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::816069131564:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Enable IAM User Permissions"
                    },
                  + {
                      + Action    = [
                          + "kms:Encrypt",
                          + "kms:Decrypt",
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:CreateGrant",
                          + "kms:ListGrants",
                          + "kms:DescribeKey",
                        ]
                      + Condition = {
                          + "ForAnyValue:StringEquals" = {
                              + "kms:EncryptionContextKeys" = "aws:rds:db-id"
                            }
                          + StringEquals               = {
                              + "kms:CallerAccount" = "816069131564"
                              + "kms:ViaService"    = "rds.us-east-1.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow access through RDS for all principals in the account that are authorized to use RDS"
                    },
                  + {
                      + Action    = [
                          + "kms:Describe*",
                          + "kms:Get*",
                          + "kms:List*",
                          + "kms:RevokeGrant",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::816069131564:root"
                        }
                      + Resource  = "*"
                      + Sid       = "Allow direct access to key metadata to the account"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all                           = {
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
    }

  # module.app["dc-sebt-portal"].module.database_security_group.aws_security_group.this_name_prefix[0] will be destroyed
  # (because aws_security_group.this_name_prefix is not in configuration)
  - resource "aws_security_group" "this_name_prefix" {
      - arn                    = "arn:aws:ec2:us-east-1:816069131564:security-group/sg-052c720f2d7d35631" -> null
      - description            = "Security Group managed by Terraform" -> null
      - egress                 = [] -> null
      - id                     = "sg-052c720f2d7d35631" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 1433
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0527e5eaa8457bf2d",
                ]
              - self             = false
              - to_port          = 1433
            },
        ] -> null
      - name                   = "sebt-portal-development-database-20250613191726526800000001" -> null
      - name_prefix            = "sebt-portal-development-database-" -> null
      - owner_id               = "816069131564" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"        = "sebt-portal-development-database"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all               = {
          - "Name"        = "sebt-portal-development-database"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - vpc_id                 = "vpc-024d66fcc4f521d0a" -> null

      - timeouts {
          - create = "10m" -> null
          - delete = "15m" -> null
        }
    }

  # module.app["dc-sebt-portal"].module.service["web"].aws_iam_policy.secrets will be updated in-place
  ~ resource "aws_iam_policy" "secrets" {
        id               = "arn:aws:iam::816069131564:policy/sebt-portal-development-web-secrets-access-20250612203316430400000005"
        name             = "sebt-portal-development-web-secrets-access-20250612203316430400000005"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "secretsmanager:GetSecretValue",
                          - "kms:Decrypt",
                          - "ssm:GetParameter",
                          - "ssm:GetParameters",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:kms:us-east-1:816069131564:key/4527d3ac-0df9-4d4d-8f02-7f0f22a32b28",
                          - "arn:aws:ssm:us-east-1:816069131564:parameter/sebt-portal/development/web/otel",
                          - "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "application" = "sebt-portal-development"
            "environment" = "development"
            "program"     = "safety-net"
            "project"     = "sebt-portal"
        }
        # (7 unchanged attributes hidden)
    }

  # module.app["dc-sebt-portal"].module.database.module.database_security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security Group managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "sebt-portal-development-database-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"        = "sebt-portal-development-database"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all               = {
          + "Name"        = "sebt-portal-development-database"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + vpc_id                 = "vpc-024d66fcc4f521d0a"

      + timeouts {
          + create = "10m"
          + delete = "15m"
        }
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_instance.aws_db_instance.this[0] will be destroyed
  # (because aws_db_instance.this is not in configuration)
  - resource "aws_db_instance" "this" {
      - address                               = "sebt-portal-development-20250613171717133500000001.cxcgye2iuxai.us-east-1.rds.amazonaws.com" -> null
      - allocated_storage                     = 20 -> null
      - allow_major_version_upgrade           = true -> null
      - apply_immediately                     = true -> null
      - arn                                   = "arn:aws:rds:us-east-1:816069131564:db:sebt-portal-development-20250613171717133500000001" -> null
      - auto_minor_version_upgrade            = true -> null
      - availability_zone                     = "us-east-1b" -> null
      - backup_retention_period               = 0 -> null
      - backup_target                         = "region" -> null
      - backup_window                         = "09:20-09:50" -> null
      - ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> null
      - character_set_name                    = "SQL_Latin1_General_CP1_CI_AS" -> null
      - copy_tags_to_snapshot                 = false -> null
      - customer_owned_ip_enabled             = false -> null
      - database_insights_mode                = "standard" -> null
      - db_subnet_group_name                  = "sebt-portal-development-20250613164153054600000001" -> null
      - dedicated_log_volume                  = false -> null
      - delete_automated_backups              = true -> null
      - deletion_protection                   = false -> null
      - domain_dns_ips                        = [] -> null
      - enabled_cloudwatch_logs_exports       = [
          - "agent",
          - "error",
        ] -> null
      - endpoint                              = "sebt-portal-development-20250613171717133500000001.cxcgye2iuxai.us-east-1.rds.amazonaws.com:1433" -> null
      - engine                                = "sqlserver-web" -> null
      - engine_version                        = "16.00.4185.3.v1" -> null
      - engine_version_actual                 = "16.00.4185.3.v1" -> null
      - final_snapshot_identifier             = "final-sebt-portal-development-ff830582" -> null
      - hosted_zone_id                        = "Z2R2ITUGPM61AM" -> null
      - iam_database_authentication_enabled   = false -> null
      - id                                    = "db-AQO5FR4MFE4QXEK44UMOZ5DUYE" -> null
      - identifier                            = "sebt-portal-development-20250613171717133500000001" -> null
      - identifier_prefix                     = "sebt-portal-development-" -> null
      - instance_class                        = "db.t3.small" -> null
      - iops                                  = 3000 -> null
      - kms_key_id                            = "arn:aws:kms:us-east-1:816069131564:key/685dec83-ce64-422e-b69e-1ebddb298a4d" -> null
      - license_model                         = "license-included" -> null
      - listener_endpoint                     = [] -> null
      - maintenance_window                    = "fri:03:00-fri:03:30" -> null
      - manage_master_user_password           = true -> null
      - master_user_secret                    = [
          - {
              - kms_key_id    = "arn:aws:kms:us-east-1:816069131564:key/059725fa-3cf5-4f38-ae36-762576b4e33e"
              - secret_arn    = "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9"
              - secret_status = "active"
            },
        ] -> null
      - master_user_secret_kms_key_id         = "arn:aws:kms:us-east-1:816069131564:key/059725fa-3cf5-4f38-ae36-762576b4e33e" -> null
      - max_allocated_storage                 = 100 -> null
      - monitoring_interval                   = 0 -> null
      - multi_az                              = false -> null
      - network_type                          = "IPV4" -> null
      - option_group_name                     = "default:sqlserver-web-16-00" -> null
      - parameter_group_name                  = "sebt-portal-development-20250613181046817500000001" -> null
      - performance_insights_enabled          = false -> null
      - performance_insights_retention_period = 0 -> null
      - port                                  = 1433 -> null
      - publicly_accessible                   = false -> null
      - replicas                              = [] -> null
      - resource_id                           = "db-AQO5FR4MFE4QXEK44UMOZ5DUYE" -> null
      - skip_final_snapshot                   = false -> null
      - status                                = "available" -> null
      - storage_encrypted                     = true -> null
      - storage_throughput                    = 125 -> null
      - storage_type                          = "gp3" -> null
      - tags                                  = {
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all                              = {
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - username                              = "root" -> null
      - vpc_security_group_ids                = [
          - "sg-052c720f2d7d35631",
        ] -> null

      - timeouts {}
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_instance.aws_iam_role.enhanced_monitoring[0] will be destroyed
  # (because aws_iam_role.enhanced_monitoring is not in configuration)
  - resource "aws_iam_role" "enhanced_monitoring" {
      - arn                   = "arn:aws:iam::816069131564:role/rds-monitoring-role" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-06-13T18:49:31Z" -> null
      - force_detach_policies = false -> null
      - id                    = "rds-monitoring-role" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "rds-monitoring-role" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Name"        = "rds-monitoring-role"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all              = {
          - "Name"        = "rds-monitoring-role"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - unique_id             = "AROA34AMCXUWMZRFPWHTB" -> null
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be destroyed
  # (because aws_iam_role_policy_attachment.enhanced_monitoring is not in configuration)
  - resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      - id         = "rds-monitoring-role-20250613184932227900000001" -> null
      - policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole" -> null
      - role       = "rds-monitoring-role" -> null
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_instance.random_id.snapshot_identifier[0] will be destroyed
  # (because random_id.snapshot_identifier is not in configuration)
  - resource "random_id" "snapshot_identifier" {
      - b64_std     = "/4MFgg==" -> null
      - b64_url     = "_4MFgg" -> null
      - byte_length = 4 -> null
      - dec         = "4286776706" -> null
      - hex         = "ff830582" -> null
      - id          = "_4MFgg" -> null
      - keepers     = {
          - "id"                  = "sebt-portal-development"
          - "snapshot_identifier" = null
        } -> null
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_parameter_group.aws_db_parameter_group.this[0] will be destroyed
  # (because aws_db_parameter_group.this is not in configuration)
  - resource "aws_db_parameter_group" "this" {
      - arn          = "arn:aws:rds:us-east-1:816069131564:pg:sebt-portal-development-20250613181046817500000001" -> null
      - description  = "sebt-portal-development parameter group" -> null
      - family       = "sqlserver-web-16.0" -> null
      - id           = "sebt-portal-development-20250613181046817500000001" -> null
      - name         = "sebt-portal-development-20250613181046817500000001" -> null
      - name_prefix  = "sebt-portal-development-" -> null
      - skip_destroy = false -> null
      - tags         = {
          - "Name"        = "sebt-portal-development"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all     = {
          - "Name"        = "sebt-portal-development"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
    }

  # module.app["dc-sebt-portal"].module.mssql.module.db_subnet_group.aws_db_subnet_group.this[0] will be destroyed
  # (because aws_db_subnet_group.this is not in configuration)
  - resource "aws_db_subnet_group" "this" {
      - arn                     = "arn:aws:rds:us-east-1:816069131564:subgrp:sebt-portal-development-20250613164153054600000001" -> null
      - description             = "sebt-portal-development subnet group" -> null
      - id                      = "sebt-portal-development-20250613164153054600000001" -> null
      - name                    = "sebt-portal-development-20250613164153054600000001" -> null
      - name_prefix             = "sebt-portal-development-" -> null
      - subnet_ids              = [
          - "subnet-04f0c33c52950250c",
          - "subnet-053de37a3ecb7298b",
          - "subnet-0686b2ea9061f8367",
        ] -> null
      - supported_network_types = [
          - "IPV4",
        ] -> null
      - tags                    = {
          - "Name"        = "sebt-portal-development"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - tags_all                = {
          - "Name"        = "sebt-portal-development"
          - "application" = "sebt-portal-development"
          - "environment" = "development"
          - "program"     = "safety-net"
          - "project"     = "sebt-portal"
        } -> null
      - vpc_id                  = "vpc-024d66fcc4f521d0a" -> null
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.aws_db_instance.this[0] will be created
  + resource "aws_db_instance" "this" {
      + address                               = (known after apply)
      + allocated_storage                     = 20
      + allow_major_version_upgrade           = true
      + apply_immediately                     = true
      + arn                                   = (known after apply)
      + auto_minor_version_upgrade            = true
      + availability_zone                     = (known after apply)
      + backup_retention_period               = (known after apply)
      + backup_target                         = (known after apply)
      + backup_window                         = (known after apply)
      + ca_cert_identifier                    = (known after apply)
      + character_set_name                    = (known after apply)
      + copy_tags_to_snapshot                 = false
      + database_insights_mode                = (known after apply)
      + db_name                               = (known after apply)
      + db_subnet_group_name                  = (known after apply)
      + dedicated_log_volume                  = false
      + delete_automated_backups              = true
      + deletion_protection                   = false
      + domain_fqdn                           = (known after apply)
      + enabled_cloudwatch_logs_exports       = [
          + "agent",
          + "error",
        ]
      + endpoint                              = (known after apply)
      + engine                                = "sqlserver-web"
      + engine_lifecycle_support              = (known after apply)
      + engine_version                        = "16.00.4185.3.v1"
      + engine_version_actual                 = (known after apply)
      + final_snapshot_identifier             = (known after apply)
      + hosted_zone_id                        = (known after apply)
      + iam_database_authentication_enabled   = false
      + id                                    = (known after apply)
      + identifier                            = (known after apply)
      + identifier_prefix                     = "sebt-portal-development-"
      + instance_class                        = "db.t3.small"
      + iops                                  = (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      + license_model                         = (known after apply)
      + listener_endpoint                     = (known after apply)
      + maintenance_window                    = (known after apply)
      + manage_master_user_password           = true
      + master_user_secret                    = (known after apply)
      + master_user_secret_kms_key_id         = "arn:aws:kms:us-east-1:816069131564:key/059725fa-3cf5-4f38-ae36-762576b4e33e"
      + max_allocated_storage                 = 100
      + monitoring_interval                   = 0
      + monitoring_role_arn                   = (known after apply)
      + multi_az                              = false
      + nchar_character_set_name              = (known after apply)
      + network_type                          = (known after apply)
      + option_group_name                     = (known after apply)
      + parameter_group_name                  = (known after apply)
      + performance_insights_enabled          = false
      + performance_insights_kms_key_id       = (known after apply)
      + performance_insights_retention_period = (known after apply)
      + port                                  = (known after apply)
      + publicly_accessible                   = false
      + replica_mode                          = (known after apply)
      + replicas                              = (known after apply)
      + resource_id                           = (known after apply)
      + skip_final_snapshot                   = false
      + snapshot_identifier                   = (known after apply)
      + status                                = (known after apply)
      + storage_encrypted                     = true
      + storage_throughput                    = (known after apply)
      + storage_type                          = "gp3"
      + tags                                  = {
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all                              = {
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + timezone                              = (known after apply)
      + username                              = "root"
      + vpc_security_group_ids                = (known after apply)

      + timeouts {}
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.aws_iam_role.enhanced_monitoring[0] will be created
  + resource "aws_iam_role" "enhanced_monitoring" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "monitoring.rds.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "rds-monitoring-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"        = "rds-monitoring-role"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all              = {
          + "Name"        = "rds-monitoring-role"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0] will be created
  + resource "aws_iam_role_policy_attachment" "enhanced_monitoring" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonRDSEnhancedMonitoringRole"
      + role       = "rds-monitoring-role"
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_instance.random_id.snapshot_identifier[0] will be created
  + resource "random_id" "snapshot_identifier" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 4
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + keepers     = {
          + "id"                  = "sebt-portal-development"
          + "snapshot_identifier" = null
        }
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_parameter_group.aws_db_parameter_group.this[0] will be created
  + resource "aws_db_parameter_group" "this" {
      + arn          = (known after apply)
      + description  = "sebt-portal-development parameter group"
      + family       = "sqlserver-web-16.0"
      + id           = (known after apply)
      + name         = (known after apply)
      + name_prefix  = "sebt-portal-development-"
      + skip_destroy = false
      + tags         = {
          + "Name"        = "sebt-portal-development"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all     = {
          + "Name"        = "sebt-portal-development"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
    }

  # module.app["dc-sebt-portal"].module.database.module.mssql["this"].module.db_subnet_group.aws_db_subnet_group.this[0] will be created
  + resource "aws_db_subnet_group" "this" {
      + arn                     = (known after apply)
      + description             = "sebt-portal-development subnet group"
      + id                      = (known after apply)
      + name                    = (known after apply)
      + name_prefix             = "sebt-portal-development-"
      + subnet_ids              = [
          + "subnet-04f0c33c52950250c",
          + "subnet-053de37a3ecb7298b",
          + "subnet-0686b2ea9061f8367",
        ]
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name"        = "sebt-portal-development"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + tags_all                = {
          + "Name"        = "sebt-portal-development"
          + "application" = "sebt-portal-development"
          + "environment" = "development"
          + "program"     = "safety-net"
          + "project"     = "sebt-portal"
        }
      + vpc_id                  = (known after apply)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecs_service.module.fargate.aws_ecs_service.main[0] will be updated in-place
  ~ resource "aws_ecs_service" "main" {
      ~ desired_count                      = 0 -> 1
        id                                 = "arn:aws:ecs:us-east-1:816069131564:service/sebt-portal-development-web/sebt-portal-development-web"
        name                               = "sebt-portal-development-web"
        tags                               = {
            "application" = "sebt-portal-development"
            "environment" = "development"
            "program"     = "safety-net"
            "project"     = "sebt-portal"
        }
      ~ task_definition                    = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web:11" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.app["dc-sebt-portal"].module.service["web"].module.ecs_service.module.fargate.module.task.aws_ecs_task_definition.main[0] must be replaced
+/- resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web:11" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:816069131564:task-definition/sebt-portal-development-web" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command          = [
                      - "--config=/etc/ecs/container-insights/otel-task-metrics-config.yaml",
                    ]
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "OTEL_LOG_LEVEL"
                          - value = "info"
                        },
                    ]
                  - essential        = false
                  - image            = "public.ecr.aws/aws-observability/aws-otel-collector:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "otel-collector"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "otel-collector"
                  - portMappings     = []
                  - secrets          = [
                      - {
                          - name      = "AOT_CONFIG_CONTENT"
                          - valueFrom = "arn:aws:ssm:us-east-1:816069131564:parameter/sebt-portal/development/web/otel"
                        },
                    ]
                  - systemControls   = []
                  - volumesFrom      = []
                },
              - {
                  - cpu               = 256
                  - environment       = [
                      - {
                          - name  = "DATABASE_HOST"
                          - value = "sebt-portal-development-20250613171717133500000001.cxcgye2iuxai.us-east-1.rds.amazonaws.com:1433"
                        },
                    ]
                  - essential         = true
                  - image             = "816069131564.dkr.ecr.us-east-1.amazonaws.com/sebt-portal-development-web:665690c57392ffcf536e3733f9ad4a219a045620"
                  - linuxParameters   = {
                      - initProcessEnabled = true
                    }
                  - logConfiguration  = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/aws/ecs/sebt-portal/development/web"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "ecs"
                        }
                    }
                  - memory            = 512
                  - memoryReservation = 512
                  - mountPoints       = []
                  - name              = "sebt-portal-development-web"
                  - portMappings      = [
                      - {
                          - containerPort = 8080
                          - hostPort      = 8080
                          - protocol      = "tcp"
                        },
                    ]
                  - secrets           = [
                      - {
                          - name      = "DATABASE_PASSWORD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9:password::"
                        },
                      - {
                          - name      = "DATABASE_USERNAME"
                          - valueFrom = "arn:aws:secretsmanager:us-east-1:816069131564:secret:rds!db-810abc7e-8474-4512-bb79-c1a1bc80a43d-u0v3r9:username::"
                        },
                    ]
                  - systemControls    = []
                  - volumesFrom       = []
                },
            ] # forces replacement
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "sebt-portal-development-web" -> (known after apply)
      ~ revision                 = 11 -> (known after apply)
        tags                     = {
            "application" = "sebt-portal-development"
            "environment" = "development"
            "program"     = "safety-net"
            "project"     = "sebt-portal"
        }
        # (10 unchanged attributes hidden)
    }

Plan: 11 to add, 2 to change, 11 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```